Tekla Open API Reference for Tekla Structures 2025
ClosedGraphicObjectAttributes Methods
The ClosedGraphicObject.ClosedGraphicObjectAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from AttributesBase.)
LoadAttributes
 Loads the attributes from the specified file.
 (Inherited from AttributesBase.)
Top
See Also
Reference
ClosedGraphicObject.ClosedGraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace